In [1]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df = pd.read_csv("./data/titanic.csv")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [3]:
pd.__version__

u'0.20.1'

In [5]:
df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [15]:
df.fare.describe()

count    891.000000
mean      32.204208
std       49.693429
min        0.000000
25%        7.910400
50%       14.454200
75%       31.000000
max      512.329200
Name: fare, dtype: float64

In [7]:
cols = ['fare', 'age']
bins = [0, 14, 50, 100, 500]
counts = df.fare.value_counts(bins=bins)
counts

(-0.001, 14.0]    437
(14.0, 50.0]      294
(50.0, 100.0]     107
(100.0, 500.0]     50
Name: fare, dtype: int64

In [9]:
def get_distribution(df, bins, by=None, count_na=True, count_zero=True):
    print df.shape
    bin_counts = df.apply(lambda x: x.value_counts(bins=bins))
    null_counts = df.isnull().sum()
    null_counts.name = 'null_count'
    zero_counts = df.apply(lambda x: (x==0).sum())
    zero_counts.name = 'zero_count'
#     bin_counts = bin_counts.append([null_counts, zero_counts])
    return bin_counts
#     return zero_counts

In [10]:
get_distribution(df[cols], bins)

(891, 2)

                fare   age
(-0.001, 14.0]   437   NaN
(14.0, 50.0]     294  77.0
(50.0, 100.0]    107  64.0
(100.0, 500.0]    50   0.0

In [59]:
factor = pd.qcut(df.fare, [0, .25, .5, .75, 1.]) # this maps index to qcut bins
df.groupby(factor).mean()

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
fare,,,,,,,,
"(-0.001, 7.91]",0.197309,2.919283,28.328671,0.053812,0.022422,7.034172,0.802691,0.941704
"(7.91, 14.454]",0.303571,2.616071,28.989600,0.147321,0.098214,10.386050,0.683036,0.834821
"(14.454, 31.0]",0.454955,2.225225,29.086610,0.752252,0.612613,23.028677,0.500000,0.342342
"(31.0, 512.329]",0.581081,1.468468,31.999588,1.144144,0.797297,88.677872,0.423423,0.288288

In [8]:
df[cols + ['class']].groupby('class').apply(lambda df: get_distribution(df, bins))

(216, 3)
(216, 3)
(184, 3)
(491, 3)

zero_count  fare  age  class
class
First          5    0      0
Second         6    0      0
Third          4    0      0